Revit 2024 API
View.GetDependentViewIds Method
 Get the ids of dependent views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetDependentViewIds()
Visual Basic
Public Function GetDependentViewIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetDependentViewIds()
Return Value
 Ids of the dependent views.
See Also
View Class
Autodesk.Revit.DB Namespace